Revit 2024 API
EnergyAnalysisMaterial.SpecificHeatCapacity Property
 The specific heat capacity of the material.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public double SpecificHeatCapacity { get; }
Visual Basic
Public ReadOnly Property SpecificHeatCapacity As Double
	Get
Visual C++
public:
property double SpecificHeatCapacity {
	double get ();
}
See Also
EnergyAnalysisMaterial Class
Autodesk.Revit.DB.Analysis Namespace